# Pandas
* Overcomes the limitations of numpy arrays in dealing with labelled and missing data
* Built on top of Numpy
* Introduces Series and DataFrame datastructures, which take on most of data mining

## 1. Pandas Series
* One-dimensional array of indexed data.
* Built on top of numpy 1D array, and also has features similar to dictionaries.

In [ ]:
# Pandas series differ form numpy arrays in that, we can define labels for the series index

In [1]:
import numpy as np
import pandas as pd
pd.__version__

'0.23.4'

### 1.1 Creating pandas series objects
* Can be created from a list, numpy array, or tuple, or dictionary

**Creating series from a list**

In [ ]:
my_series = pd.Series([0.5,0.8,0.9,1.3,0.4]) # similar to numpy array except now we have explicit index.
my_series

In [ ]:
my_series.values # returns the value of the series

In [ ]:
list(my_series.index) # returns an index object. We can get the same thing through my_series.keys()

In [ ]:
my_series = pd.Series([1,2,3,4], index = ["a","b","c","d"]) # index can be changed.
my_series

In [ ]:
my_series.shape # It can be seen that pandas series is one-dimensional array.

**creating series from a numpy array**

In [ ]:
my_arr = np.array([8,7,6,5]) # creating Series from a numpy array
pd.Series(my_arr)

**creating series from a tuple**

In [ ]:
tp = (11,12,9,1)
pd.Series(tp) # Creating series from a tuple.

**creating series from a dictionary**

In [ ]:
my_dict = {'k1':1, 'k2':3, 'k4':5} # dictionary can be easily converted to series. keys become index, values are values.
pd.Series(my_dict)

In [ ]:
my_series

In [ ]:
my_series2 = pd.Series([5,6,7,8], index = ["a","b","c","d"])
my_series2

In [ ]:
my_series+my_series2 # we can do element wise operations just like numpy arrays

In [ ]:
d3 = {"k1": 2, "k2":[1,2,3], "k3":("a","b"),"k4":{"sk1":5}}

In [ ]:
d3

In [ ]:
pd.Series(d3)

### 1.2 Indexing & Modifying Series Objects

#### 1.2.1 Indexing
* Use square brackets [] for indexing

In [ ]:
my_series = pd.Series([1.5,0.2,1.3,0.4], index=['a', 'b', 'c', 'd'])
my_series

In [ ]:
my_series['a'] # explicit indexing by name of index (similar to indexing of a dictionary)

In [ ]:
my_series[0:3] # implicit indexing from 0th row to 2nd row.

In [ ]:
my_series[3::-1] # getting the series elements in a reverse order

**potential for confusion with this indexing**

In [ ]:
my_series2 = pd.Series(['a', 'b', 'c', 'd', 'e'], index = [1,2,3,4,5])
my_series2

In [ ]:
my_series2[1]

In [ ]:
my_series2[1:4]

**best to use special indexing attributes (mainly for pandas series and dataframes)**
* .loc - for explicit indexing with names
* .iloc - for implicit indexing with row numbers or column numbers
* .ix - for mixed indexing

In [ ]:
my_series2

In [ ]:
my_series2.loc[3] # with .loc, its explicit indexing, provide actual row or index names

In [ ]:
my_series2.iloc[3] # with .iloc, its implicit indexing,  provide row  index

In [ ]:
my_series2.iloc[1:]

In [ ]:
my_series2.loc[1:]

#### 1.2.2 Modifying Series

In [ ]:
my_series2

In [ ]:
my_series2.loc[5] = 'y'
my_series2

In [ ]:
my_series2.append(pd.Series(['f'])) # series is one-dimensional. append can be used to add additional series elements.
#not happening in place

In [ ]:
my_series2

In [ ]:
my_series2.loc[6] = 'z'
my_series2

In [ ]:
my_series2.drop(5) # drop index position 5

In [ ]:
my_series2.drop

## 2. Pandas DataFrames
*  2D array with labelled data.
* Sequence of aligned Series objects.
* Generalization of numpy array with labelled data

In [ ]:
# Basically each row or column is a series

### 2.1 Creating Data Frames

In [ ]:
pd.DataFrame



#### Init signature: pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

In [ ]:
# DataFrames can be created by reading csv files, from from a 2D numpy array, a dictionary of series objects, 
# from a dictionary of list objects.

**Creating data frame from a 2D numpy array**

In [ ]:
df = pd.DataFrame(np.random.rand(4,5))
df

In [ ]:
df = pd.DataFrame(np.random.rand(4,5), index = 'r1 r2 r3 r4'.split(), columns = 'c1 c2 c3 c4 c5'.split())
df

In [ ]:
df.index #  We get the index (basically rownames)

In [ ]:
df.columns # to obtain column names, df.keys() will get you the same result.

In [ ]:
#df.keys()

**Creating data frame from a dictionary of lists**

In [ ]:
df = pd.DataFrame({"k1":[1,2,3], "k2":["a","b","c"]}) 
# no need to specify column names, because dictionary keys are same as columns for dataframes

In [ ]:
df

**from lists**

In [ ]:
df = pd.DataFrame([[1,2,3,4]]) # we need to pass a list of lists
df

**from list of lists**

In [ ]:
df = pd.DataFrame([[1,2,3,4],["a","b","c","d"]], index='r1,r2'.split(","), columns='c1,c2,c3,c4'.split(","))
df

**Creating data frame from a dictionary of series objects**

In [ ]:
d1 = {'Josh': 6, 'kevin': 5.5, 'kumar': 5.8, 'shelly': 4.9}
d2 = {'Josh': 180 , 'kevin': 150, 'kumar': 140, 'shelly': 120}
s1 = pd.Series(d1)
s2 = pd.Series(d2)
print ('s1\n', s1, '\n')
print ('s2\n', s2)

In [ ]:
df = pd.DataFrame({'height':s1, 'weight':s2}) # created from a dictionary of series objects. 
df

In [ ]:
df = pd.DataFrame({'height':d1, 'weight':d2}) # it can also be created from a dictionary of dictionaries
df

**Creating data frame by reading data from a csv file (pd.read_csv)**

In [ ]:
pwd

In [ ]:
df = pd.read_csv('Wine.csv') # this is the more common way, we will deal with data frames

In [ ]:
df.shape # to get the dimensions. Similar to dim(df) in R

In [ ]:
df.head(3) # show first few rows. Similar to head(df) in R

**df.info()** will give a brief info on data frame columns and types. similar to str(df) in R 

**df.describe()** will give brief staistics on all numeric type columns. similar to summary(df) in R

In [ ]:
df.info()

In [ ]:
df.describe() # brief statistics

**methods have df.(), and others just df.    This is because methods use df.method(), and attributes just df.attribute**

**Method does some kind of action. attributes just state some info on the data frame.**

### 2.2 Indexing/slicing/ DataFrame
    - df.loc[] for explicit indexing on rows and columns (with names)
    - df.iloc[] for implicit indexing on rows and columns (with index position)
    - df[] for explicit indexing with column names

In [ ]:
df.head(3)

In [ ]:
df['Alcohol'].head() # to get a particular column

In [ ]:
df[["Alcohol","Phenols"]].head(3) # pass a list of columns.  In R we use c("c1","c4")

In [ ]:
df[1] # to index on rows, better to use .loc, and .iloc.

In [ ]:
rnames = ['r' + str(i) for i in range(0,178)] # creating a list of row names
df.index = rnames # assign these row names to df index
df.head()

In [ ]:
df.loc['r3'] # use .loc to explict indexing on rows. for explicit indexing on columns .loc is not needed. But better to use .loc

In [ ]:
df.loc['r3',:] # row 'r3', all columns. Also better to use ',' between rows and columns

In [ ]:
df.head()

In [ ]:
df.iloc[2:4,1:4].head() # to get 2,3 rows and 1,2,3 columns

In [ ]:
df.loc[['r3','r4','r5'],['Alcohol', 'Malic', 'Ash']].head() 
# when selecting multiple columns or rows, pass as a list. Also use .loc for indexing with names

### 2.3 Few important dataframe methods

In [ ]:
df.head(3)

**df.max(), df.min(), df.sum(), df.mean(), df.idxmax(), df.idxmin() and many more**

**df.max()**

In [ ]:
df['Alcohol'].max() # to get the maximum value of a particular column

In [ ]:
df.head(3)

In [ ]:
df.max(axis=0) # df.max(axis=0 or 1) to get the maximum value along each column or row. By default axis = 0
#axis = 0 will collapse values along rows, axis =1 will collapse along columns

**df.idxmax()**

In [ ]:
df['Alcohol'].idxmax()# this gives the index name where id is max, similar to which.max() in R

In [ ]:
df.idxmax() # if we do it on whole data frame, it will give the index value for each column, where max value occurs

**df.mean()**

In [ ]:
df.mean(axis=0) # to get the mean of each column

**df.apply()**

df.apply(func, axis) can be used to apply any function across all columns or rows. similart to apply() in R.

functions can also be user defined functions.

In [ ]:
df.apply(np.mean, 0)  # same as above result. 
#instead of np.mean,we could have applied any function here including user defined one

In [ ]:
df.head(2)

**df[ ].unique()**  to get all the unique elements in a column

In [ ]:
df['Type'].unique() # lists all the unique elements in wine 'Type' column

**df[ ].nunique()** to obtain total # of unique elements

In [ ]:
df['Type'].nunique() # total number of unique values

**df[ ].value_counts()** unique values and their frequencies

In [ ]:
df['Type'].value_counts() # frequency of each unique value.  In R we simply use table(df['c1']) to get unique values

**df.sort_values('column', axis)** To sort a dataframe based on a particular column

In [ ]:
df.sort_values('Alcohol') # In R we can use the order() which gives sorted indices, which can then be used in df[order(),]

**df.groupby()** Another powerful method to group the data frame based on a column, and then apply some function

In [ ]:
d = {"item":["chair", "desk", "rug", "table", "chair", "couch", "couch", "chair", "rug", "desk"], 
     "agent":["sally", "bob", "sally", "amy", "bob", "amy", "sally", "bob", "amy", "sally"],
      "sale_price": [100, 110, 200, 100, 150, 800, 1000, 100, 85, 110],
        "quantity": [10, 5, 15, 8, 20, 5, 4, 11, 9, 5]}

In [ ]:
df = pd.DataFrame(d)
df['revenue'] = df['quantity']*df['sale_price']
df

In [ ]:
df.groupby("item").mean() # only quantity, sale_price, revenue are returned because they are numeric and agent is not.

In [ ]:
df.groupby("agent")['quantity', 'revenue'].sum() # we can also specify the columns on which we want the mean.

## 2.3 Boolean Masking Data Frames

In [103]:
boston = pd.read_csv('boston_housing.csv')

In [ ]:
boston.shape

In [ ]:
boston.head(3)

In [ ]:
boston.describe()

In [ ]:
boston.loc[(boston['RM'] > 8), 'MEDV' ] # finding MEDV when # of rooms are high > 8

In [ ]:
boston.loc[(boston['RM'] > 8), 'MEDV' ].mean()
# always remember to use .loc for rows when using names or booleans

In [ ]:
boston.loc[boston['NOX'] > 0.8,'MEDV'].mean() # Finding the mean of MEDV where Nox is high.

In [ ]:
boston.loc[boston['NOX'] < 0.4,'MEDV'].mean() # Finding the mean of MEDV where Nox is low.

**.ix allows a hybrid approach to indexing (hybrid between loc and iloc)**

In [ ]:
boston.ix[0:3, ['NOX','MEDV']]

In [ ]:
# when using multiple conditions, do not use 'and','or' instead use &, |
boston.loc[(boston["RM"]>8) & (boston["LSTAT"] < 3),:] # because and/or will work for entire object, not element wise comparison
# in R we use & anyway and it doesnt matter.

### 2.4 Modifying Data Frames

In [18]:
import numpy as np
import pandas as pd
df = pd.DataFrame([[0.1, 0.2, 0.3, 0.4], [1, 2, 3, 4], [10, 20, 30, 40]], index = 'r0 r1 r2'.split(), columns = 'c0 c1 c2 c3'.split())
df

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [19]:
df['c4'] = [0.5, 5, 50] # to add a new column
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

**.assign()** to include multiple new columns

**.append() to add by rows (column names should match if we do not want any missing values**)

In [20]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

In [21]:
df2 = pd.DataFrame([[7, 8, 9, 10, 11], [11, 21, 31, 41, 51]], index = 'r3 r4'.split(), columns = 'c0 c1 c2 c3 c4'.split())
df2

    c0  c1  c2  c3  c4
r3   7   8   9  10  11
r4  11  21  31  41  51

In [22]:
df.append(df2) # appending doesnt happen in place

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0
r3   7.0   8.0   9.0  10.0  11.0
r4  11.0  21.0  31.0  41.0  51.0

In [23]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

**.pop() can be used to remove a column**

In [24]:
df.pop("c4") # returns the popped column and mutates the original df

r0     0.5
r1     5.0
r2    50.0
Name: c4, dtype: float64

In [25]:
df

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [26]:
df["c4"] = [0.5, 5 ,50] # adding the column back
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

**.drop() can be used to remove a column or row**

In [33]:
df.drop("c4",axis=1) # to remove a column. 1 is for columns. Similarly we can delete rows as well. Deletion not happening in place.
# set inplace=True, in the argument if we want the original df to mutate.

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [34]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

In [35]:
df.drop(['c2','c4'],axis=1)

      c0    c1    c3
r0   0.1   0.2   0.4
r1   1.0   2.0   4.0
r2  10.0  20.0  40.0

In [36]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

In [39]:
df.drop('r2',axis=0) # to remove a row

     c0   c1   c2   c3   c4
r0  0.1  0.2  0.3  0.4  0.5
r1  1.0  2.0  3.0  4.0  5.0

In [40]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

In [42]:
df.drop(df.index[0:1],0) # to drop rows, by row index position. for columns we could similarly use df.columns

      c0    c1    c2    c3    c4
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

In [ ]:
del df['c3'] # del command can also be used to delete columns. happening in place. del also works for lists and dictionary

In [ ]:
df

In [ ]:
df

In [ ]:
df.iloc[1,1] = 100
df

### reset index

In [43]:
df = pd.DataFrame(np.random.randint(0,10,(2,3)), index = 'r0 r1'.split(), columns = 'c0 c1 c2'.split())
df

    c0  c1  c2
r0   1   5   5
r1   2   7   4

In [46]:
df.reset_index(drop=True) # inplace = False by default

   c0  c1  c2
0   1   5   5
1   2   7   4

In [47]:
df

    c0  c1  c2
r0   1   5   5
r1   2   7   4

In [48]:
df.set_index("c2", inplace=True) # to set a column as index. if inplace=False, original df unchanged

In [49]:
df

    c0  c1
c2
5    1   5
4    2   7

In [50]:
df.index= ['a', 'b'] # to give a new index

In [51]:
df

   c0  c1
a   1   5
b   2   7

### Concatenating, Merging dataframes

In [52]:
# for joining data frames, use concatenate and merge
# use merge if we just want to add dataframes by rows or columns as long as all the index and column names are same

**pd.concat** (for concatenating rows or columns to an existing data frame)

In [53]:
df1 = pd.DataFrame(np.random.randn(3,4), index = 'r0 r1 r2'.split(), columns = 'c0 c1 c2 c3'.split())
df1

          c0        c1        c2        c3
r0  0.671966  0.492236  0.539450  1.907608
r1 -1.662815  0.954306 -0.426056 -0.185122
r2 -0.525407  0.109900 -1.767251 -0.684535

In [54]:
df2 = pd.DataFrame(np.random.randn(3,4), index = 'r0 r1 r2'.split(), columns = 'c4 c5 c6 c7'.split())
df2

          c4        c5        c6        c7
r0 -0.920351  0.171209  0.714892 -0.195568
r1  0.020015  0.818487  0.056296 -1.812480
r2 -0.737175 -1.586403 -0.213725  0.266219

In [55]:
pd.concat([df1,df2], axis=1) # axis = 1 for column, default is 0
# same row indexes, but differnt column names. We can use concat to join data frames together by column

,c0,c1,c2,c3,c4,c5,c6,c7
r0,0.671966,0.492236,0.539450,1.907608,-0.920351,0.171209,0.714892,-0.195568
r1,-1.662815,0.954306,-0.426056,-0.185122,0.020015,0.818487,0.056296,-1.812480
r2,-0.525407,0.109900,-1.767251,-0.684535,-0.737175,-1.586403,-0.213725,0.266219

In [56]:
df1

          c0        c1        c2        c3
r0  0.671966  0.492236  0.539450  1.907608
r1 -1.662815  0.954306 -0.426056 -0.185122
r2 -0.525407  0.109900 -1.767251 -0.684535

In [57]:
df3 = pd.DataFrame(np.random.randn(3,4), index = 'r3 r4 r5'.split(), columns = 'c0 c1 c2 c3'.split())
df3

          c0        c1        c2        c3
r3 -0.298084 -0.051603 -0.496280 -0.752979
r4  1.120659  0.109752 -0.126804 -0.775435
r5  0.387112 -1.085101 -1.251426  1.648094

In [58]:
pd.concat([df1,df3], axis=0) # joining data frames by rows, column names must match here if we dont want any NaN

          c0        c1        c2        c3
r0  0.671966  0.492236  0.539450  1.907608
r1 -1.662815  0.954306 -0.426056 -0.185122
r2 -0.525407  0.109900 -1.767251 -0.684535
r3 -0.298084 -0.051603 -0.496280 -0.752979
r4  1.120659  0.109752 -0.126804 -0.775435
r5  0.387112 -1.085101 -1.251426  1.648094

In [59]:
df1

          c0        c1        c2        c3
r0  0.671966  0.492236  0.539450  1.907608
r1 -1.662815  0.954306 -0.426056 -0.185122
r2 -0.525407  0.109900 -1.767251 -0.684535

In [60]:
df2

          c4        c5        c6        c7
r0 -0.920351  0.171209  0.714892 -0.195568
r1  0.020015  0.818487  0.056296 -1.812480
r2 -0.737175 -1.586403 -0.213725  0.266219

In [61]:
pd.concat([df1,df2], axis=0) # we get NaN because to join by rows, the column names are different.

C:\Users\sridh\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,c0,c1,c2,c3,c4,c5,c6,c7
r0,0.671966,0.492236,0.539450,1.907608,NaN,NaN,NaN,NaN
r1,-1.662815,0.954306,-0.426056,-0.185122,NaN,NaN,NaN,NaN
r2,-0.525407,0.109900,-1.767251,-0.684535,NaN,NaN,NaN,NaN
r0,NaN,NaN,NaN,NaN,-0.920351,0.171209,0.714892,-0.195568
r1,NaN,NaN,NaN,NaN,0.020015,0.818487,0.056296,-1.812480
r2,NaN,NaN,NaN,NaN,-0.737175,-1.586403,-0.213725,0.266219

**merge**

In [62]:
# if we want to merge by some common column, then we use merge

In [63]:
df1 = pd.DataFrame([[1, 2, 3, 4], [2, 5, 6, 7], [3, 7, 5, 8]], columns = 'c0 c1 c2 c3'.split())
df1

   c0  c1  c2  c3
0   1   2   3   4
1   2   5   6   7
2   3   7   5   8

In [64]:
df2 = pd.DataFrame([[1, 21, 31, 41], [2, 51, 61, 71], [3, 71, 51, 81]], columns = 'c0 c5 c6 c7'.split())
df2

   c0  c5  c6  c7
0   1  21  31  41
1   2  51  61  71
2   3  71  51  81

In [65]:
df3 = pd.merge(df1,df2) # Pandas automatically recognizes that each data frame has a common 'c0' column. 
# we can also specify in the arguments that on = 'c0' 
df3

   c0  c1  c2  c3  c5  c6  c7
0   1   2   3   4  21  31  41
1   2   5   6   7  51  61  71
2   3   7   5   8  71  51  81

In [67]:
df4 = pd.merge(df1,df2,how='inner', left_on = 'c0', right_on='c0') 
df4
# left_on and right_on are used, when the column values might represent the same thing, but just the column names are different.
# here in this example, it doesnt matter, because c0 means same for both right and left columns.

   c0  c1  c2  c3  c5  c6  c7
0   1   2   3   4  21  31  41
1   2   5   6   7  51  61  71
2   3   7   5   8  71  51  81

In [ ]:
# There are many more merge operations, left join, right join, outer join etc..

## 2.5 Missing Values
* isnull(), isna()
* notnull(), notna()
* dropna()
* fillna()

In [68]:
import pandas as pd
import numpy as np

In [69]:
d = {"c0": [1,2,3,7,np.nan,12], "c1": [4,12, 15, np.nan, 5, 8], "c2":[10, 11, np.nan, np.nan, 9, 12], "c3":[3,6,np.nan, 9, np.nan, 11]}
d

{'c0': [1, 2, 3, 7, nan, 12],
 'c1': [4, 12, 15, nan, 5, 8],
 'c2': [10, 11, nan, nan, 9, 12],
 'c3': [3, 6, nan, 9, nan, 11]}

In [70]:
df = pd.DataFrame(d)
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

**.isnull()**

In [71]:
df.isnull() # To get a dataframe of boolean values. isna() gives the same result

      c0     c1     c2     c3
0  False  False  False  False
1  False  False  False  False
2  False  False   True   True
3  False   True   True  False
4   True  False  False   True
5  False  False  False  False

In [73]:
df.isnull().sum(axis=0) # to get a count of number of missing values in each column

c0    1
c1    1
c2    2
c3    2
dtype: int64

**.notnull()**

In [77]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

**.dropna()**

In [78]:
df.dropna() # select rows without any NaN values. axis = 0 is the default argument. default inplace = False

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
5  12.0   8.0  12.0  11.0

In [79]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

In [80]:
df.dropna(axis=1) # select columns without any NaN values

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [81]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

In [83]:
df.dropna(axis = 0, thresh=3) #here thresh is for non-NA values

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
5  12.0   8.0  12.0  11.0

In [85]:
df.dropna(axis=1, thresh=5) # look at all columns, and get any column which has atleast 5 non missing values

     c0    c1
0   1.0   4.0
1   2.0  12.0
2   3.0  15.0
3   7.0   NaN
4   NaN   5.0
5  12.0   8.0

In [86]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

**fillna()**

In [87]:
df.fillna(100) # fill missing values with a constant

      c0     c1     c2     c3
0    1.0    4.0   10.0    3.0
1    2.0   12.0   11.0    6.0
2    3.0   15.0  100.0  100.0
3    7.0  100.0  100.0    9.0
4  100.0    5.0    9.0  100.0
5   12.0    8.0   12.0   11.0

In [90]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

In [91]:
df.fillna(df.mean(axis=0),axis=0) # fill na with mean values in each column. default inplace=False

     c0    c1    c2     c3
0   1.0   4.0  10.0   3.00
1   2.0  12.0  11.0   6.00
2   3.0  15.0  10.5   7.25
3   7.0   8.8  10.5   9.00
4   5.0   5.0   9.0   7.25
5  12.0   8.0  12.0  11.00

In [92]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

In [94]:
df.fillna(method='bfill') # similarly we have 'bfill'

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   9.0   9.0
3   7.0   5.0   9.0   9.0
4  12.0   5.0   9.0  11.0
5  12.0   8.0  12.0  11.0

## 2.6 Numerical operations on Data Frames

In [95]:
df1 = pd.DataFrame(np.random.randint(0,10,(3,4)), index = 'r0 r1 r2'.split(), columns='c0 c1 c2 c3'.split())
df2 = pd.DataFrame(np.random.randint(0,10,(3,4)), index = 'r0 r1 r2'.split(), columns='c0 c1 c2 c3'.split())
print (df1, '\n')
print (df2)

    c0  c1  c2  c3
r0   5   1   3   0
r1   6   0   5   8
r2   5   2   5   4

    c0  c1  c2  c3
r0   4   9   1   9
r1   3   3   1   8
r2   1   9   7   9

In [97]:
df1 + 8 # broadcasting operations similar to numpy arrays.

    c0  c1  c2  c3
r0  13   9  11   8
r1  14   8  13  16
r2  13  10  13  12

In [98]:
df1

    c0  c1  c2  c3
r0   5   1   3   0
r1   6   0   5   8
r2   5   2   5   4

In [99]:
df1 + df2

    c0  c1  c2  c3
r0   9  10   4   9
r1   9   3   6  16
r2   6  11  12  13

**any Numpy Ufunc, will work on Pandas Series and DataFrames**

In [100]:
np.exp(df1) # we can also apply Numpy Ufuncs directly on Pandas series or data frames.

            c0        c1          c2           c3
r0  148.413159  2.718282   20.085537     1.000000
r1  403.428793  1.000000  148.413159  2980.957987
r2  148.413159  7.389056  148.413159    54.598150

## reading and writing

In [101]:
# typically pd.read_ will give many options to read and df.to_ many options to write
# pd.read_csv, pd.read_excel, df.to_csv etc..

In [104]:
boston.to_csv('boston_copy.csv')